[
  {
    "title": "El tiempo",
    "description": "Conoce la previsión meteorológica del sitio que desees. Espera, también hay un truco genial: el fondo se oscurece o se ilumina, dependiendo de si es la hora de tomar el sol o de mirar las estrellas en la ciudad que estés comprobando.",
    "image": "/projectImages/weatherN.png",
    "image2": "/projectImages/weatherN.png",
    "image3": "",
    "body": "Esta aplicación utiliza React y TailwindCSS para proporcionar una interfaz intuitiva y dinámica. Consulta las previsiones meteorológicas de cualquier ciudad, con una experiencia visual inmersiva que cambia según la hora del día.",
    "technologies": ["React", "TailwindCSS"],
    "github": "https://github.com/DrunkPsyduck/weather",
    "deployed": "https://Tiempo.mariocanales.es",
    "disabled": false,
    "bgcolor": "#8b00b5",
    "id": "1"
  },
  {
    "title": "MoneyGo",
    "description": "Controla tus finanzas obteniendo los gastos y mostrándolos con gráficas avanzadas que permitirán saber en qué gastas tu dinero. Fue mi proyecto de fin de Máster.",
    "image": "/projectImages/moneyGo.png",
    "image2": "/projectImages/moneyGo.png",
    "image3": "",
    "body": "MoneyGo utiliza .NET Core para el backend, SQL Server para la base de datos y JavaScript para la interacción en frontend. Este proyecto escaló con el tiempo, incorporando seguridad avanzada, migración a una API y despliegues en Azure y AWS.",
    "technologies": [".NET CORE", "JavaScript", "Bootstrap"],
    "github": "https://github.com/DrunkPsyduck/MoneyGo",
    "deployed": "https://github.com/DrunkPsyduck/MoneyGo",
    "disabled": true,
    "bgcolor": "#037A68",
    "id": "2"
  },
  {
    "title": "Drawer",
    "description": "¡Dibuja sin límites con Drawer! En esta aplicación puedes usar el navegador como un lienzo para dar rienda suelta a tu creatividad. Solo es funcional en dispositivos que utilicen ratón.",
    "image": "/projectImages/Drawer.png",
    "image2": "/projectImages/Drawer.png",
    "image3": "",
    "body": "Drawer está desarrollado con React y Vite, ofreciendo una experiencia fluida y rápida para los usuarios. Diseñado para dispositivos de escritorio, es ideal para aquellos que deseen explorar su lado artístico.",
    "technologies": ["React + Vite"],
    "github": "https://github.com/DrunkPsyduck/Drawer",
    "deployed": "https://drawer.mariocanales.es",
    "disabled": false,
    "bgcolor": "#f85781",
    "id": "3"
  },
  {
    "title": "Aviatore",
    "description": "Aviatore es una maqueta creada para una empresa ficticia de viajes.",
    "image": "/projectImages/aviatore.png",
    "image2": "/projectImages/aviatoreDemo.png",
    "image3": "",
    "body": "Desarrollado con JavaScript y Bootstrap, Aviatore simula un sitio web de una agencia de viajes. Su diseño es limpio y funcional, ofreciendo una experiencia atractiva para los usuarios interesados en explorar destinos.",
    "technologies": ["JavaScript", "Bootstrap"],
    "github": "https://github.com/DrunkPsyduck/Aviatore",
    "deployed": "https://mariocsan.github.io/Aviatore/",
    "disabled": false,
    "bgcolor": "#f37737",
    "id": "4"
  },
  {
    "title": "CarAuctions",
    "description": "Un sitio web de subastas de coches. Actualmente en desarrollo.",
    "image": "/projectImages/readme.png",
    "image2": "/projectImages/readme.png",
    "image3": "",
    "body": "CarAuctions es una plataforma robusta construida con .NET, Next.js, RabbitMQ, Postgres y MongoDB. Su arquitectura basada en microservicios garantiza escalabilidad y seguridad.",
    "technologies": [".NET", "Nextjs", "RabbitMQ", "Postgres", "MongoDB"],
    "github": "https://github.com/MarioCSan/CarAuctions",
    "deployed": "",
    "disabled": true,
    "bgcolor": "#8b00b5",
    "id": "5"
  },
  {
    "title": "Gilfoyle's Bitcoin Alert",
    "description": "Inspirado en la temporada 5 de Silicon Valley de HBO, esta alerta reproduce una canción cuando Bitcoin alcanza su máximo histórico (ATH).",
    "image": "/projectImages/readme.png",
    "image2": "/projectImages/gilfoyle.jpg",
    "image3": "",
    "body": "Desarrollado en C, esta herramienta es tanto una funcionalidad práctica como un guiño divertido a los fans de Silicon Valley.\n En la serie, Gilfoyle usaba un pequeño script que indicaba cuándo era rentable 'minar' Bitcoin. En este programa solo se reproduce cuándo Bitcoin alcanza un nuevo precio máximo o ATH. ¡Ten cuidado con la música de alerta, puede ser intensa!",
    "technologies": ["C"],
    "github": "https://github.com/MarioCSan/BitcoinAlert",
    "deployed": "",
    "disabled": true,
    "bgcolor": "#f85781",
    "id": "6"
  }
]
